package Lab4


fun main(){
    print("Введите страну: ")
    val str = readln()
    when (str.lowercase()) {
        "россия" -> println("Основная национальнось: русские\n" +
                "Население: 146 150 789\n" +
                "Язык: русский")
        "сша" -> println("Основная национальнось: американец\n" +
                "Население: 333 287 557\n" +
                "Язык: американский английский")
        "япония" -> println("Основная национальнось: японцы\n" +
                "Население: 124 342 000\n" +
                "Язык: японский")
        "германия" -> println("Основная национальнось: немцы\n" +
                "Население: 84 358 845\n" +
                "Язык: немецкий")
        "италия" -> println("Основная национальнось: итальянцы\n" +
                "Население: 58 782 813\n" +
                "Язык: итальянский")
        "франция" -> println("Основная национальнось: французы\n" +
                "Население: 68 521 974\n" +
                "Язык: французский")
        "китай" -> println("Основная национальнось: китайцы\n" +
                "Население: 1 411 750 000\n" +
                "Язык: китайский")
        else -> println("О стране нет информации или страны не существует")
    }
}